[
  {
    "overall": 4,
    "career": 4,
    "balance": 3,
    "compensation": 3,
    "culture": 3,
    "management": 3,
    "summary": "Overall it is good; career growth and work life balance vary greatly depending on your managers and the team",
    "pros": "Standard process. Some leadership principles actually help with getting work done.",
    "cons": "Some time team politics, poor work life balance and finally return-to-office\n",
    "reasonResign": null,
    "createdAt": "2025-03-26T12:44:15.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 3,
    "culture": 2,
    "management": 2,
    "summary": "Great tech, bad WLB and comp",
    "pros": "Lots of teams, internal switch is easy. You can pick and choose according to your interests.",
    "cons": "Oncalls, work life balance, inflated promotion bar, compensation for tenured folks",
    "reasonResign": null,
    "createdAt": "2025-03-26T12:41:32.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 4,
    "compensation": 4,
    "culture": 3,
    "management": 4,
    "summary": "Liked it",
    "pros": "Manager was talented. Teammates were experienced. Liked the org at consumer payments.",
    "cons": "Unclear career growth path. Gap between L5 and L6 was too large.",
    "reasonResign": null,
    "createdAt": "2025-03-26T11:28:42.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 4,
    "compensation": 3,
    "culture": 3,
    "management": 2,
    "summary": "Depends if your manager is not awful",
    "pros": "Work on interesting problems at AWS. Learn a lot if you try",
    "cons": "Def underpaid. Politics needed more than technical output for recognition.",
    "reasonResign": null,
    "createdAt": "2025-03-26T07:41:44.000Z"
  },
  {
    "overall": 3,
    "career": 4,
    "balance": 2,
    "compensation": 1,
    "culture": 3,
    "management": 4,
    "summary": "4 years in AWS",
    "pros": "Good project scope. You can be tech lead at L5.\n\nFair performance evaluation.\n\nTechnically sound managers. This may not be true throughout Amazon. But managers in my team are quite good.\n\nGet to learn a lot on cutting-edge tech with AWS being one of the top cloud services.",
    "cons": "Very tight delivery timeline. Higher leadership tends to weight timely delivery over everything else as long as you pass the basic product quality check.\n\nHigh operational workload. Lots of time spent on maintaining dependencies, pipelines, software security risks.\n\nPoor benefits. I struggled a lot with only 6 weeks' paternity leave after my first kid's birth\n",
    "reasonResign": null,
    "createdAt": "2025-03-26T05:08:28.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 3,
    "compensation": 4,
    "culture": 3,
    "management": 4,
    "summary": "Overall a reasonable work experience.",
    "pros": "While this may vary depending on the team, I met great people and managers and learned a lot of cool things.",
    "cons": "The talent review process is brutal. WLB may not be ideal for certain teams.",
    "reasonResign": null,
    "createdAt": "2025-03-26T03:22:51.000Z"
  },
  {
    "overall": 1,
    "career": 3,
    "balance": 1,
    "compensation": 4,
    "culture": 2,
    "management": 1,
    "summary": "Worst WLB",
    "pros": "Nice hands-on projects, Great knowledge sharing from a few of the peers",
    "cons": "Racism in some of the orgs, managers with zero tech knowledge as well",
    "reasonResign": null,
    "createdAt": "2025-03-26T00:05:02.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 2,
    "compensation": 4,
    "culture": 2,
    "management": 2,
    "summary": "Bad work life balance",
    "pros": "High compensation, company still has prestige, which helps when interviewing elsewhere. Lots of high impact work.",
    "cons": "Too many internal tools, bad benefits, lots of tedious work, and difficult management. My team was relatively good, but even then you can feel pressure from top down. Not much innovation nor transferrable skills when everything is internal, and promotion is pretty slow.",
    "reasonResign": null,
    "createdAt": "2025-03-25T23:13:01.000Z"
  },
  {
    "overall": 5,
    "career": 4,
    "balance": 2,
    "compensation": 5,
    "culture": 1,
    "management": 2,
    "summary": "Work is much as good the comp is",
    "pros": "- Good compensation \n- freedom to change teams smoothly. \n- challenging work- u r always solving things that matter\n- Once experienced - u develop edge over others\n",
    "cons": "- Not a place for nice person. Dont expect collaboration, not wise to be collaborative (people steal ur work)\n- u need always need to deliver in less time and defend ur near-perfect work like an ideal work.\n- heavy price of failure. One miss = redundancy \n- Always Messy work to pick up from. no documentation, no help in place. \n- Always need to strike a balance between politics and good work.\n- Manager is the king. Two way feedback doesnot exist \n- No company investment in developing the employees ",
    "reasonResign": null,
    "createdAt": "2025-03-25T22:38:07.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 3,
    "culture": 2,
    "management": 2,
    "summary": "Resume builder, but not sustainable ",
    "pros": "Amazon is an exceptional place to build your career and gain invaluable experience. By aligning with the right leadership, you can seamlessly transition across teams and business units, broadening your expertise and diversifying your skill set",
    "cons": "Amazon is not a long-term career play, where most thrive for 2-4 years at best, then burnout. Over time, you’ll notice high-caliber talent leaving, leaving behind weaker bench players . Rarely do you see veterans from Google, Apple, or Microsoft move to Amazon; the flow is usually the opposite.  \n\nThat said, Amazon excels at grooming talent for future roles elsewhere—if you’re willing to grind and absorb as much as possible. Whether you’re a mid-level IC, senior manager, director, or VP, your shelf life at Amazon is roughly 5 years. A few hold on for a decade+ chasing a director role (if they started mid-level), but by year 2-3, it becomes clear: with the right strategy, more money and faster growth happens outside Amazon.",
    "reasonResign": null,
    "createdAt": "2025-03-25T21:15:03.000Z"
  },
  {
    "overall": 2,
    "career": 3,
    "balance": 2,
    "compensation": 2,
    "culture": 1,
    "management": 1,
    "summary": "I am not happy with the culture",
    "pros": "The work I got to do is good, I am learning and enjoy that work.",
    "cons": "- extremely poor management \n- entire management is whimsical \n- I feel scared working here\n- very whimsical in their decisions. No logical flow of decisions.\n- extremely bad work culture.",
    "reasonResign": null,
    "createdAt": "2025-03-25T20:25:27.000Z"
  },
  {
    "overall": 2,
    "career": 2,
    "balance": 2,
    "compensation": 4,
    "culture": 1,
    "management": 1,
    "summary": "Don't trust what the leadership team sells you",
    "pros": "High compensation and good for your resume. You can meet interesting people. Changing teams is relatively easy, if you're not happy where you are, move to a different team, don't hesitate about it.",
    "cons": "Backstabbing culture. People will try to sell you on a great company to work for during the interviews, just for you to discover that none of that is true. Managers don't have any power to affect change at all.",
    "reasonResign": "I was put in focus and later on in pivot.",
    "createdAt": "2025-03-25T18:24:27.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 4,
    "compensation": 3,
    "culture": 3,
    "management": 3,
    "summary": "Used to be a good company before but now layoff culture is prevalent ",
    "pros": "Learning, fast paced environment, AI products, brand value and global exposure.",
    "cons": "Slow growth, frequent re orgs, job security and layoff fear has been become a part now",
    "reasonResign": null,
    "createdAt": "2025-03-25T18:12:55.000Z"
  },
  {
    "overall": 1,
    "career": 3,
    "balance": 2,
    "compensation": 3,
    "culture": 2,
    "management": 1,
    "summary": "Horrible Middle Management",
    "pros": "- good stamp on your resume \n- you will learn so much you will be set wherever you go next\n-Brilliant coworkers",
    "cons": "- it's a hit or miss on the manager. If you get some vengeful manager Good luck. Unless you're kissing up to them it'll be tough. You go can from tt to being kicked out in a matter of meetings",
    "reasonResign": null,
    "createdAt": "2025-03-25T17:22:21.000Z"
  },
  {
    "overall": 1,
    "career": 1,
    "balance": 2,
    "compensation": 3,
    "culture": 1,
    "management": 1,
    "summary": "The worst 2.5 years of my career",
    "pros": "Some of the people on my direct team are nice, most of them are too busy playing politics to treat others like human beings though. The pay is nice, and we get a free latte per day. ",
    "cons": "AVOID AMAZON if you can. Is an okay paycheck worth wrecking your mental health? Worth your self worth being destroyed? Worth developing an auto-immune disease due to stress and it destroying your joints for the rest of your life? It's up to you, but I personally don't recommend it. ",
    "reasonResign": null,
    "createdAt": "2025-03-25T16:53:32.000Z"
  },
  {
    "overall": 2,
    "career": 2,
    "balance": 3,
    "compensation": 4,
    "culture": 1,
    "management": 1,
    "summary": "lazy managers, old tech",
    "pros": "paid well, lazy manager sometimes just ignored me over caring what i did",
    "cons": " promo standards vary team to team, coworkers are not friendly",
    "reasonResign": null,
    "createdAt": "2025-03-25T14:31:32.000Z"
  },
  {
    "overall": 5,
    "career": 5,
    "balance": 5,
    "compensation": 4,
    "culture": 4,
    "management": 4,
    "summary": "I love Amazon:)",
    "pros": "Work is fast paced (I work in org focused on GenAI) so I get to work on more interesting projects, not just measured in units sold.",
    "cons": "I’m the only female in a team of 20 male engineers but everyone is respectful so still I’m happy",
    "reasonResign": null,
    "createdAt": "2025-03-25T10:19:28.000Z"
  },
  {
    "overall": 3,
    "career": 1,
    "balance": 3,
    "compensation": 2,
    "culture": 3,
    "management": 3,
    "summary": "Culture is Nice",
    "pros": "Good projects , work here is meaningful and is Interesting ",
    "cons": "No growth Opportunity for DevOps role , which is frustrating ",
    "reasonResign": null,
    "createdAt": "2025-03-25T08:09:47.000Z"
  },
  {
    "overall": 2,
    "career": 1,
    "balance": 3,
    "compensation": 3,
    "culture": 1,
    "management": 1,
    "summary": "Great place for learning, bad place for long term",
    "pros": "Techonology wise is a really good place for learning. Also, amazon hiring bar is a bit lower than other places",
    "cons": "Really toxic work culture, you cannot count in managers to coach you",
    "reasonResign": null,
    "createdAt": "2025-03-25T06:59:41.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 4,
    "compensation": 5,
    "culture": 3,
    "management": 4,
    "summary": "Amazon is very hit or miss, I just happen to be on the good side.",
    "pros": "(assuming good product) very interesting work, decent office spaces. Nothing much to say.",
    "cons": "Teams are a complete hit or miss. You could be doing jack all, working extremely long hours or in an oppressive team culture, or you could have an incredibly chill team or working on incredibly interesting work. I fall on the latter side.  Bad benefits, 5 day RTO, lots of bureaucracy (LP's), rough oncalls.",
    "reasonResign": null,
    "createdAt": "2025-03-25T04:09:45.000Z"
  },
  {
    "overall": 3,
    "career": 5,
    "balance": 2,
    "compensation": 1,
    "culture": 2,
    "management": 2,
    "summary": "Constant competition",
    "pros": "You learn a lot of aws and the best practices",
    "cons": "Constant comparison between peers, statistics games, lottery for good or bad management",
    "reasonResign": null,
    "createdAt": "2025-03-25T03:03:16.000Z"
  },
  {
    "overall": 5,
    "career": 5,
    "balance": 2,
    "compensation": 4,
    "culture": 4,
    "management": 2,
    "summary": "Accelerated growth at the cost of work life balance ",
    "pros": "- Chance to work on products that can have a huge impact \n- Engineering excellence adaptation to build highly available, low latency products that can support insane transactions \n- Chance to work with extremely smart people ",
    "cons": "- Work life balance \n- Leadership is adamant and promoting day-2 culture \n",
    "reasonResign": null,
    "createdAt": "2025-03-24T22:22:50.000Z"
  },
  {
    "overall": 5,
    "career": 5,
    "balance": 5,
    "compensation": 5,
    "culture": 5,
    "management": 5,
    "summary": "Good place to work for the right folks",
    "pros": "great leadership principles good doc writing culture.  lots of software engineering problems on the right team",
    "cons": "intense work hours are sometimes required of the employees.  Periods of stress.",
    "reasonResign": null,
    "createdAt": "2025-03-24T20:28:06.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 3,
    "culture": 4,
    "management": 3,
    "summary": "Great for Early Career ",
    "pros": "Can get good work opportunity, Access to Good Seniors and Teams, and Learning material",
    "cons": "Hard Promotions, bad work life balance, Vision seems lost a timed.",
    "reasonResign": null,
    "createdAt": "2025-03-24T16:35:50.000Z"
  },
  {
    "overall": 5,
    "career": 4,
    "balance": 3,
    "compensation": 4,
    "culture": 5,
    "management": 3,
    "summary": "Great for career growth",
    "pros": "\nComp\nCareer growth\nEasy to switch between teams if you want to\n\n\n",
    "cons": "Politics\nWork life balance \nNeed to be street smart to grow here\n\n",
    "reasonResign": null,
    "createdAt": "2025-03-24T14:28:07.000Z"
  },
  {
    "overall": 1,
    "career": 2,
    "balance": 1,
    "compensation": 2,
    "culture": 1,
    "management": 1,
    "summary": "Terrible wlb",
    "pros": "Learn a lot, good as resume builder, that’s about it",
    "cons": "Management preferring own race, wlb, terrible refreshers unless TT, frugal mindset ",
    "reasonResign": null,
    "createdAt": "2025-03-24T13:54:38.000Z"
  },
  {
    "overall": 4,
    "career": 2,
    "balance": 4,
    "compensation": 4,
    "culture": 4,
    "management": 3,
    "summary": "Good engineers but bad growth",
    "pros": "Big company title, good engineers surrounding. Coworkers are collaborative and internal transfer is easy",
    "cons": "Promotion felt extremely hard if you got struggled management team \n",
    "reasonResign": null,
    "createdAt": "2025-03-24T09:35:17.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 2,
    "compensation": 4,
    "culture": 2,
    "management": 2,
    "summary": "Pretty bad wlb, constant (bad) changes",
    "pros": "Good pay, looks good on resume, internship is pretty easy",
    "cons": "Terrible wlb, lack of growth mentality, management is not good",
    "reasonResign": null,
    "createdAt": "2025-03-24T07:26:49.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 2,
    "compensation": 4,
    "culture": 2,
    "management": 2,
    "summary": "Worst WLB",
    "pros": "Paymaster. One of the best in the industry given its size",
    "cons": "WLB\nToo much politics\nRTO5 which is not at all flexible",
    "reasonResign": null,
    "createdAt": "2025-03-24T06:15:35.000Z"
  },
  {
    "overall": 3,
    "career": 4,
    "balance": 2,
    "compensation": 5,
    "culture": 2,
    "management": 3,
    "summary": "Tough but you’ll learn a lot",
    "pros": "Fantastic exposure and learning opportunities. Helps you improve at writing and thinking clearly. ",
    "cons": "Leadership principles are often misinterpreted. Bad manager can make your life difficult. ",
    "reasonResign": null,
    "createdAt": "2025-03-24T05:43:31.000Z"
  }
]