[
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 3,
    "culture": 3,
    "management": 3,
    "summary": "Never feel bored",
    "pros": "There are endless stream of work, endless pages. Get ready for it.",
    "cons": "Work life balance has never be a reality here. The minimum expectation is 50 hours a week.\n\n",
    "reasonResign": null,
    "createdAt": "2025-04-28T08:21:32.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 3,
    "compensation": 2,
    "culture": 4,
    "management": 4,
    "summary": "Extremely Org Dependent (AWS)",
    "pros": "In the right team you can find amazing technical problems that only exist at the scale of Amazon. There are truly remarkable people in this company pushing the industry forward. However, you really need to search internally to find these places. Your skill growth will never stop here if you hop around internally.",
    "cons": "The compensation model of both an assumed 15% YoY increase, along with a 2 year delay to reap the benefits of rating increases is incredibly backwards. Promotions to L6+ are halted because of no scope, with almost zero exceptions. There are some truly mediocre engineers who talk a big game that has managed to capture the attention of certain leaders. There are also engineering leaders with zero technical experience who make disastrous organization decisions. Even the best team will have weeks where you must work 60 hours a week a least a month or two a year, otherwise a solid 40 hours is enough in many cases if you set boundaries.",
    "reasonResign": null,
    "createdAt": "2025-04-28T07:15:10.000Z"
  },
  {
    "overall": 3,
    "career": 2,
    "balance": 4,
    "compensation": 3,
    "culture": 3,
    "management": 3,
    "summary": "Good place to start your sde career",
    "pros": "I am in a pretty good team so we have good wlb and very supportive teammate. ",
    "cons": "Promotion is really hard now and many people are even waiting for promotion to sde2 for over 3 years. Know two people working on promotion to sde3 and they both left  in the end.",
    "reasonResign": null,
    "createdAt": "2025-04-28T07:00:53.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 4,
    "compensation": 2,
    "culture": 2,
    "management": 2,
    "summary": "Good wlb",
    "pros": "aws is so easy to use but overall depends on team culture",
    "cons": "Upper mgmt can be pretty bad depending on your team.",
    "reasonResign": null,
    "createdAt": "2025-04-28T06:53:49.000Z"
  },
  {
    "overall": 3,
    "career": 1,
    "balance": 1,
    "compensation": 5,
    "culture": 2,
    "management": 1,
    "summary": "Do not come , hell on earth",
    "pros": "Good compensation, you will get to learn quickly, a bit too quickly  ",
    "cons": "Politics , mandatory pips , bureaucracy for promo , leadership heavy , 0 concept of work life balance , low hikes ",
    "reasonResign": null,
    "createdAt": "2025-04-28T05:29:18.000Z"
  },
  {
    "overall": 5,
    "career": 5,
    "balance": 3,
    "compensation": 5,
    "culture": 3,
    "management": 5,
    "summary": "Ok work life balance",
    "pros": "Compensation, Quality of work is great. Smart people around is helpful!\n",
    "cons": "Too high expectations, everything is urgent until the next urgent thing comes up.",
    "reasonResign": null,
    "createdAt": "2025-04-28T03:17:39.000Z"
  },
  {
    "overall": 3,
    "career": 4,
    "balance": 4,
    "compensation": 3,
    "culture": 2,
    "management": 1,
    "summary": "Bad management, interesting work",
    "pros": "Work is interesting and impactful and the benefits are great",
    "cons": "Your manager can really affect your quality of life at work and there are way too many bad managers that can make your life miserable",
    "reasonResign": "I did not get along with my manager and she made work unenjoyable",
    "createdAt": "2025-04-27T21:01:39.000Z"
  },
  {
    "overall": 2,
    "career": 1,
    "balance": 3,
    "compensation": 3,
    "culture": 1,
    "management": 1,
    "summary": "Innovation is Dead at Amazon",
    "pros": "It's relatively easy to get into, the pay is decent, the processes are clear.",
    "cons": " * Burnt out from constant busyness driven by overhead and bureaucracy\n * Manager gives directives without understanding or reviewing the code.\n * Management seems more focused on optics and easily reportable 'wins' rather than genuine, long-term impact.\n * Dealing with top-down requirements that often feel nonsensical.",
    "reasonResign": null,
    "createdAt": "2025-04-27T17:00:01.000Z"
  },
  {
    "overall": 2,
    "career": 3,
    "balance": 1,
    "compensation": 5,
    "culture": 1,
    "management": 3,
    "summary": "This place is on war footing everyday",
    "pros": "Money - Depends on stock performance but this is the only big factor. Although remember, they will make you work for two and pay you for 1.5.\nBrand - Valued in the market. You would at least get a foot in the door. But read the cons before you jump to conclusions.\nScale - Interesting problems to solve that are challenging. \n\n",
    "cons": "1. Culture \n2. Learning - This might be a surprise but everything is very internally focused. Doc writing does not anything to your resume and adds a lot of work and pain in your day to day work. \n\n3. Leadership - Least connected and bothered about you. \n",
    "reasonResign": null,
    "createdAt": "2025-04-27T13:21:52.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 5,
    "compensation": 4,
    "culture": 3,
    "management": 3,
    "summary": "It’s team dependent but good compensation",
    "pros": "Good compensation \nYou work on cool stuff, learn new technologies \nMost people are a meeting call away and willing to help",
    "cons": "Partner teams can be exhausting to work with, everyone is trying to save their pie of work and not share \nBenefits are solid but not great ",
    "reasonResign": null,
    "createdAt": "2025-04-27T12:04:29.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 1,
    "compensation": 4,
    "culture": 3,
    "management": 2,
    "summary": "Lofty aspirations but succumbing to it's size",
    "pros": "Inspiring vision with multiple Structured process and access to multiple internal tools as enabler",
    "cons": "Company size is now so large that it becomes too tough to make slightest of change without long discussions and looping in leadership",
    "reasonResign": null,
    "createdAt": "2025-04-27T08:10:54.000Z"
  },
  {
    "overall": 4,
    "career": 3,
    "balance": 3,
    "compensation": 3,
    "culture": 5,
    "management": 4,
    "summary": "Growth has slowed a lot",
    "pros": "You will get to work with cutting edge technology at Amazon",
    "cons": "Amazon has Slow Career growth now that company is not growing ",
    "reasonResign": null,
    "createdAt": "2025-04-27T01:05:07.000Z"
  },
  {
    "overall": 2,
    "career": 1,
    "balance": 3,
    "compensation": 1,
    "culture": 1,
    "management": 1,
    "summary": "At L7, to promote you must drop specialization, master word docs, and polish apples. Expertise alone won’t cut it.",
    "pros": "\t•\tHuge opportunities to work on impactful, high-visibility projects.\n\t•\tAccess to cutting-edge technology and large-scale customer challenges.\n\t•\tSmart, driven colleagues.\n\t•\tStrong brand name and exit opportunities.",
    "cons": "\t•\tIf you want to stay a deep specialist, promotion beyond L7 is almost impossible.\n\t•\tTo move up, you must shift focus from your craft to becoming a professional word document writer and skilled politician.\n\t•\tSuccess heavily depends on mastering “apple polishing” (internal stakeholder management) rather than deepening your technical or business expertise.\n\t•\tBurnout is common due to constant pressure to “do more with less.”\n\t•\tPromotions feel subjective at senior levels, with emphasis on optics over outcomes.",
    "reasonResign": null,
    "createdAt": "2025-04-26T23:44:33.000Z"
  },
  {
    "overall": 1,
    "career": 1,
    "balance": 1,
    "compensation": 3,
    "culture": 1,
    "management": 1,
    "summary": "toxic enviroment ",
    "pros": "RSUs are the main goal here, career progration takes at leSt 3 years to\nmove up",
    "cons": "you have to give in to the toxic environment in order to advance your career",
    "reasonResign": null,
    "createdAt": "2025-04-26T19:23:23.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 3,
    "culture": 3,
    "management": 2,
    "summary": "Good company. Rewards performance but Need to know the right people to grow after L6 ",
    "pros": "Tons of exec level exposure and high visibility projects. Easy to move across different organizations. ",
    "cons": "Terrible performance management methodology. Unnecessary stress and drives competition within the team. ",
    "reasonResign": null,
    "createdAt": "2025-04-26T19:18:45.000Z"
  },
  {
    "overall": 2,
    "career": 1,
    "balance": 1,
    "compensation": 3,
    "culture": 1,
    "management": 1,
    "summary": "Only worth it for the TC",
    "pros": "Not a place to build a long term career. Only worth it for the higher than Industry avg TC...depending on how long that lasts. ",
    "cons": "Doesn't provide a place for learning or grow into mgmt. Just a truck load of upward buttering and favoritism.",
    "reasonResign": null,
    "createdAt": "2025-04-26T18:53:57.000Z"
  },
  {
    "overall": 2,
    "career": 3,
    "balance": 1,
    "compensation": 3,
    "culture": 1,
    "management": 1,
    "summary": "Reviews are real",
    "pros": "If you started early like 2008 before all this cloud journey ramped up are being part of early releases, you will make a ton of money and also you know most of the stuff, otherwise your hair becomes grey reading all the quip docs. ",
    "cons": "Culture isn’t very good, and going up is hard. Switching teams is easy if you know the stuff",
    "reasonResign": null,
    "createdAt": "2025-04-26T16:58:50.000Z"
  },
  {
    "overall": 5,
    "career": 4,
    "balance": 2,
    "compensation": 3,
    "culture": 2,
    "management": 4,
    "summary": "Great learning",
    "pros": "As a non-Tech person, I learned so much from using tools and data that I didn’t have access to before (worked 10+ years before joining), covered a crazy amount of scope (one person doing the job of a 20 HC team before), so learned and grew in the 2 years more than the previous 10. Also got to work with some best people around the world.",
    "cons": "Expectation is not to meet expectations, but to always raise the bar. There’s always 130% work to be done, every hour and day is stressful and needs correct prioritization, one wrong decision and you will fall behind. I feel near burned out every Thursday night. Also not family friendly, especially in Seattle HQ (compared to Canada office).",
    "reasonResign": null,
    "createdAt": "2025-04-26T13:24:30.000Z"
  },
  {
    "overall": 4,
    "career": 3,
    "balance": 2,
    "compensation": 4,
    "culture": 5,
    "management": 3,
    "summary": "Decent, could be way better",
    "pros": "My team was nice and the work itself was decent",
    "cons": "Return to office killed everything and the leaders are so out of touch with the actual employees ",
    "reasonResign": null,
    "createdAt": "2025-04-26T12:07:29.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 4,
    "culture": 2,
    "management": 3,
    "summary": "It's a place, with a job.",
    "pros": "It pays well. In a good org there is nice balance. ",
    "cons": "Re-org every year means you will inevitably be in a bad org, and you need to know how to adjust and survive.",
    "reasonResign": null,
    "createdAt": "2025-04-26T09:11:07.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 2,
    "compensation": 3,
    "culture": 2,
    "management": 1,
    "summary": "Has evolved into a think small over fit to process company",
    "pros": "- large scope (not always)\n- tons of areas to work on",
    "cons": "- bad leadership who are really good at Amazon speak and Amazon process, but are not very good at leading people, inspiring them or understanding the problem space.",
    "reasonResign": null,
    "createdAt": "2025-04-26T03:53:11.000Z"
  },
  {
    "overall": 3,
    "career": 4,
    "balance": 2,
    "compensation": 3,
    "culture": 2,
    "management": 3,
    "summary": "Very aggressive culture, no balance",
    "pros": "Lot of growth opportunities in various sectors. Good for career growth",
    "cons": "Very hard to balance life. Aggressive expectations and goals every time",
    "reasonResign": null,
    "createdAt": "2025-04-26T02:20:06.000Z"
  },
  {
    "overall": 4,
    "career": 3,
    "balance": 5,
    "compensation": 4,
    "culture": 5,
    "management": 5,
    "summary": "Great cloud platform, good management team, very talented people.",
    "pros": "Management\nWlb\nComp\nGood career challenge\nSmart and talented colleagues ",
    "cons": "Challenging to navigate the company\nLots of reorgs\nGreat platform, but weak the commercial side\n",
    "reasonResign": null,
    "createdAt": "2025-04-25T23:22:10.000Z"
  },
  {
    "overall": 5,
    "career": 3,
    "balance": 3,
    "compensation": 2,
    "culture": 5,
    "management": 4,
    "summary": "Great mentoring",
    "pros": "Lot of pros depends on having a good manager, lots of good technical challenges",
    "cons": "Compensation is the biggest con and especially RSU grants are not upto industry standards",
    "reasonResign": null,
    "createdAt": "2025-04-25T22:03:02.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 4,
    "compensation": 4,
    "culture": 4,
    "management": 4,
    "summary": "Intern, decent WLB",
    "pros": "Cool team, Alexa when it used to be a start up vibe. ",
    "cons": "Work relationships are strictly work relationships. Not much else to be said tbh.",
    "reasonResign": null,
    "createdAt": "2025-04-25T20:02:46.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 4,
    "culture": 3,
    "management": 3,
    "summary": "Ok",
    "pros": "Comp is decent. Quality of work is good. You work with smart people \n",
    "cons": "Ok company. Work life balance is a problem though. Not good ",
    "reasonResign": null,
    "createdAt": "2025-04-25T16:35:41.000Z"
  },
  {
    "overall": 3,
    "career": 2,
    "balance": 2,
    "compensation": 4,
    "culture": 3,
    "management": 2,
    "summary": "Dont be in teams with poor growth opportunities otherwise the pay is good",
    "pros": "Good pay\nInsane learning exp. You basically make AWS your life lol. You will have more exp than any BS Solutions Architect.",
    "cons": "Super hectic work\nBad WLB\nCase resolve goals if you are in Support Engineering\nTeams which has good future growth - containers, DIA.",
    "reasonResign": null,
    "createdAt": "2025-04-25T14:37:12.000Z"
  },
  {
    "overall": 5,
    "career": 5,
    "balance": 4,
    "compensation": 5,
    "culture": 4,
    "management": 4,
    "summary": "Good compensation and brand value",
    "pros": "* Compensation is good\n* Get to work with Bright minds",
    "cons": "* Sometimes too much politics is involved\n* Few teams are bad.",
    "reasonResign": null,
    "createdAt": "2025-04-25T05:50:55.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 4,
    "compensation": 4,
    "culture": 4,
    "management": 4,
    "summary": "good depends on team",
    "pros": "a lot of opportunity and people are good to work with.",
    "cons": "work impact is team dependent. a lot of churn and attrition\n",
    "reasonResign": null,
    "createdAt": "2025-04-25T03:28:03.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 2,
    "compensation": 2,
    "culture": 1,
    "management": 1,
    "summary": "Average",
    "pros": "Colleagues are fantastic and there to offer support when it hits the fan\n",
    "cons": "Management is only there to vest stock\n\nThe management team really have no power and generally spend their time position for a promotion \n\n\n\n",
    "reasonResign": null,
    "createdAt": "2025-04-25T01:42:35.000Z"
  }
]