[
  {
    "overall": 4,
    "career": 3,
    "balance": 4,
    "compensation": 5,
    "culture": 4,
    "management": 4,
    "summary": "Great place to work ",
    "pros": "Compensation is great \nGet to work on some very good projects \nVery talented engineers to work with ",
    "cons": "Culture can be improved and most of the team looks disconnected \nSlow career growth ",
    "reasonResign": null,
    "createdAt": "2025-05-14T06:28:08.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 3,
    "compensation": 4,
    "culture": 3,
    "management": 3,
    "summary": "Not as bad as people say it is",
    "pros": "Honestly it really depends on your team and your org. My team is pretty chill and not too much stress.",
    "cons": "Less benefits like other big tech. No lunch no snacks etc\n",
    "reasonResign": null,
    "createdAt": "2025-05-14T06:17:56.000Z"
  },
  {
    "overall": 3,
    "career": 2,
    "balance": 3,
    "compensation": 3,
    "culture": 4,
    "management": 4,
    "summary": "Great company ",
    "pros": "Great place to learn, smart people, fast pace, very high bar on deliverable quality. Culture is strong and LP are really a thing ",
    "cons": "Getting day by day too burecratic , decision making is slower than before. Leader takes less decision and demand their manager or skip to take decision. ",
    "reasonResign": null,
    "createdAt": "2025-05-14T05:59:43.000Z"
  },
  {
    "overall": 3,
    "career": 2,
    "balance": 2,
    "compensation": 2,
    "culture": 2,
    "management": 1,
    "summary": "The work you do is pretty good however the management is extremely poor",
    "pros": "Great cutting edge work, scope for learning new technologies, good opportunity for lateral movement ",
    "cons": "AWS PROSERVE is not seen in the same light as solution architects are, and merely based on the SOW contractual values, while delivering real value in terms of deliverables as well introducing customers to new services. Changing rules for promos, purposely delaying it bcoz the org  is not net neutral is extremely demoralizing and demotivating",
    "reasonResign": null,
    "createdAt": "2025-05-14T05:26:44.000Z"
  },
  {
    "overall": 4,
    "career": 5,
    "balance": 1,
    "compensation": 4,
    "culture": 1,
    "management": 1,
    "summary": "Would only recommend if you need money ",
    "pros": "The comp and the perks and the resume brand are the only pros.",
    "cons": "Good place to learn how to deal with the worst people you'll ever meet in your career.",
    "reasonResign": null,
    "createdAt": "2025-05-14T05:18:40.000Z"
  },
  {
    "overall": 3,
    "career": 2,
    "balance": 1,
    "compensation": 4,
    "culture": 1,
    "management": 3,
    "summary": "Good place to learn",
    "pros": "Decent Compensation. Transferrable knowledge to other employer. Good in your resume",
    "cons": "Work life balance. Over indexing on delivering results without any capacity for innovation. Getting a promotion can be a pain.",
    "reasonResign": null,
    "createdAt": "2025-05-14T04:32:38.000Z"
  },
  {
    "overall": 4,
    "career": 5,
    "balance": 4,
    "compensation": 2,
    "culture": 2,
    "management": 3,
    "summary": "Great Place to Learn",
    "pros": "Good work life balance for finance teams. Always room for growth, really intelligent coworkers",
    "cons": "So many unnecessary processes and teams that are just babysitting with no real goals.",
    "reasonResign": null,
    "createdAt": "2025-05-14T03:16:37.000Z"
  },
  {
    "overall": 1,
    "career": 3,
    "balance": 2,
    "compensation": 4,
    "culture": 1,
    "management": 1,
    "summary": "WLB is team dependent - management is clueless",
    "pros": "The company has good pay, and you have lots of growth opportunities",
    "cons": "Lots of work, harsh deadlines, the managers have a mandatory pip percentage which I've noticed is decently common",
    "reasonResign": null,
    "createdAt": "2025-05-14T01:59:08.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 3,
    "culture": 3,
    "management": 2,
    "summary": "It’s ok",
    "pros": "Decent Pay, Learning and Leadership opportunities . The company does help you learn navigating the org.",
    "cons": "Day2 culture, Bad management, Unnecessary scut work. Most of the Teams build and launch just for the sake of building but not adding any value",
    "reasonResign": null,
    "createdAt": "2025-05-14T00:28:49.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 2,
    "compensation": 4,
    "culture": 2,
    "management": 2,
    "summary": "Not the same place",
    "pros": "Compensation is decent and there are still opportunities to influence. ",
    "cons": "Culture is degrading, lack of leadership vision and organization stability is creating lack of trust and chaos.\n",
    "reasonResign": null,
    "createdAt": "2025-05-13T23:41:47.000Z"
  },
  {
    "overall": 4,
    "career": 5,
    "balance": 2,
    "compensation": 2,
    "culture": 3,
    "management": 2,
    "summary": "Needs improvement",
    "pros": "Innovation still exists in some orgs, relatively more meritocratic than other big tech",
    "cons": "Massive Day2 culture in most orgs, leadership plays safe, just reduce cost to serve in stores business. No one willing to invest in long term. \n",
    "reasonResign": null,
    "createdAt": "2025-05-13T23:14:59.000Z"
  },
  {
    "overall": 3,
    "career": 4,
    "balance": 1,
    "compensation": 2,
    "culture": 2,
    "management": 1,
    "summary": "Learn a lot",
    "pros": "Learn a lot, lots of people to connect with, can easily meet similarly minded people",
    "cons": "It's a coin flip on if you get a good manager or not, work can be hell if you're not with the right people ",
    "reasonResign": null,
    "createdAt": "2025-05-13T17:36:04.000Z"
  },
  {
    "overall": 1,
    "career": 1,
    "balance": 1,
    "compensation": 5,
    "culture": 1,
    "management": 1,
    "summary": "Employees are rows in a spreadsheet",
    "pros": "Compensation, rapidly gaining high quality experience that is transferable to future employers. Mostly a good line in a CV.",
    "cons": "1) Software Engineers are treated as capacity producers in a spreadsheet. Re-orgs every 6 months to move people to where capacity is needed, with zero regard for manager-employee relationships / continuity or growth.\n2) Many senior folks in the organization were nasty, including all L7 managers, PMs, and many L6 SDEs. Frequent yelling during calls, making zero effort to being pleasant.\n3) You're in a sprint every single day, no matter what, no matter what task we're talking about, important or not, urgent or otherwise. This is not sustainable for most people. Hyper focused on execution above all else.\n4) Talent rating stack ranking every 6 months incentivizes perverse behavior - SDEs fighting for perceived impact and visibility as opposed to collaborating and helping each other. Managers trying to throw SDEs managed by peer managers under the bus so the focus moves away from their own SDEs.",
    "reasonResign": null,
    "createdAt": "2025-05-13T14:17:51.000Z"
  },
  {
    "overall": 1,
    "career": 1,
    "balance": 1,
    "compensation": 1,
    "culture": 1,
    "management": 1,
    "summary": "Managers are the worst. They lie. They set you up. Whatever you do. They will damage your mental health with no regrets.",
    "pros": "Pros? Are you kidding me? These managers are liars and cowards. This place disgusting as f",
    "cons": "Worst manager in the industry \nHR are dogs working for these managers\nDisgusting\nI saw the dark side of humanity for the first time in my life. I’m not sure when I will start to trust people again",
    "reasonResign": null,
    "createdAt": "2025-05-13T09:54:30.000Z"
  },
  {
    "overall": 1,
    "career": 1,
    "balance": 1,
    "compensation": 1,
    "culture": 1,
    "management": 1,
    "summary": "An absolute horror show, avoid if you can",
    "pros": "Stepping stone, AWS the name is somewhat useful for landing interviews but your mileage will vary",
    "cons": "- Paper pushing management with kafkaesque bureaucracy\n- Nothing ever gets done properly, escalation instead of collaboration. \n- Clueless management which tries to hit KPIs at the cost of everything and shelves the projects post their own promotion.\n- insane technical debt and band-aid solutions\n- everything is a high severity escalation\n- you are one reorg or bad quarter away from PIP (our team won awards for our good perf, go figure)\n- after some point you're mostly firefighting and your skills will atrophy\n- managers do no push back against upper management, some will term it as spineless\n- no long term vision at all from lower mgmnt\n- managers are not technical enough, they do not understand the impact of their work\n- promotion driven development (PDD), wikis are created but never updated ",
    "reasonResign": null,
    "createdAt": "2025-05-13T07:16:40.000Z"
  },
  {
    "overall": 2,
    "career": 2,
    "balance": 3,
    "compensation": 1,
    "culture": 2,
    "management": 2,
    "summary": "Org dependent - hit or miss. 90% chance of miss",
    "pros": "FAANG experience, scalability experience, cloud services experience, possibility to learn and grow \n",
    "cons": "WLF \n5 day RTO\nMediocre team mates and management \nEmpire building by managers ",
    "reasonResign": null,
    "createdAt": "2025-05-13T04:49:09.000Z"
  },
  {
    "overall": 3,
    "career": 4,
    "balance": 3,
    "compensation": 5,
    "culture": 3,
    "management": 2,
    "summary": "Politics & Slow decision making ",
    "pros": "Compensation is good compared to similar companies, opportunities to grow if you’re consistently top performer\n",
    "cons": "Work life balance, tons of meetings, pip culture, no remote work ",
    "reasonResign": null,
    "createdAt": "2025-05-13T03:07:53.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 5,
    "culture": 2,
    "management": 3,
    "summary": "Experience with Amazon is highly dependent on the particular org you're a part of",
    "pros": "CXBT has great work/life balance\nGreat manager and skip level\n",
    "cons": "RTO and RTH policies are nonsensical, particularly for the Amazon Benchmarking org.",
    "reasonResign": null,
    "createdAt": "2025-05-13T01:42:50.000Z"
  },
  {
    "overall": 2,
    "career": 1,
    "balance": 3,
    "compensation": 2,
    "culture": 1,
    "management": 1,
    "summary": "Fine for a year or two",
    "pros": "Was able to work on some pretty interesting projects and got opportunity to get into tech ",
    "cons": "Too much middle management and awful promo process. Everyone is pretty miserable and just out for themselves. ",
    "reasonResign": null,
    "createdAt": "2025-05-12T23:38:15.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 3,
    "compensation": 4,
    "culture": 3,
    "management": 3,
    "summary": "Very team dependent ",
    "pros": "Good comp, wlb can be good depending on the team.",
    "cons": "Slow growth, lots of politics, wrong manager can tank you.",
    "reasonResign": null,
    "createdAt": "2025-05-12T21:22:36.000Z"
  },
  {
    "overall": 2,
    "career": 3,
    "balance": 2,
    "compensation": 4,
    "culture": 1,
    "management": 1,
    "summary": "Beurocracy, no wlb, terribly conceived and executed rto policy ",
    "pros": "Opportunity to tackle complex, large-scale challenges that impact millions of customers globally,",
    "cons": "Demanding work culture that can sometimes lead to long hours and intense pressure, depending on the team and projects. Work-life balance can be challenging to maintain. The sheer scale and complexity of Amazon's systems can be overwhelming. ",
    "reasonResign": null,
    "createdAt": "2025-05-12T19:04:43.000Z"
  },
  {
    "overall": 2,
    "career": 5,
    "balance": 2,
    "compensation": 3,
    "culture": 2,
    "management": 1,
    "summary": "I’m pleading the fifth",
    "pros": "Maybe good base pay \nA little RSU in that takes a long time to vest \n",
    "cons": "No bonus\nNo extra perks \nVery cutthroat \nDon’t really care about their employees ",
    "reasonResign": null,
    "createdAt": "2025-05-12T17:24:07.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 3,
    "compensation": 3,
    "culture": 2,
    "management": 4,
    "summary": "Good learnings",
    "pros": "- Brand recognition\n- If you stay 1+ yrs, you’ll have deliveries to talk about",
    "cons": "- More politics over time\n- Manager pipeline used to be engineers but now shifting to TPMs",
    "reasonResign": null,
    "createdAt": "2025-05-12T17:23:24.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 3,
    "compensation": 4,
    "culture": 3,
    "management": 4,
    "summary": "Used to be a great but now is a toxic place",
    "pros": "- Get to work on large scale products\n- Still somewhat good people around",
    "cons": "- Managers\n- things have been very top down lately",
    "reasonResign": null,
    "createdAt": "2025-05-12T16:38:57.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 3,
    "compensation": 5,
    "culture": 3,
    "management": 2,
    "summary": "Good money, as long as you own your time",
    "pros": "Compensation is great, career growth is available, immediate leadership is good",
    "cons": "Upper management is terrible, top down orders rather than bottom up growth. Maintaining wlb is part of your job",
    "reasonResign": null,
    "createdAt": "2025-05-12T12:41:48.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 4,
    "compensation": 4,
    "culture": 4,
    "management": 4,
    "summary": "Great company if you’re hard working and manipluative",
    "pros": "Fast paced culture, super good if you want to learn and earn in early career. ",
    "cons": "It varies with org to org for my org, it was communication, if you are not excellent in communication you will be crushed. Don’t know why as an engineer i need to learn good phrases to convince people for my approach. If i would been that great in comm, then i would chosen MBA right not Engineering",
    "reasonResign": null,
    "createdAt": "2025-05-12T08:47:27.000Z"
  },
  {
    "overall": 4,
    "career": 4,
    "balance": 2,
    "compensation": 2,
    "culture": 3,
    "management": 3,
    "summary": "Experience depends on team",
    "pros": "Good tech challenges, and grow a lot. Once you are used to Amazon level of challenges you should be able to handle most if not all other companies.\n",
    "cons": "A bad manager can end your career if your are not careful.",
    "reasonResign": null,
    "createdAt": "2025-05-12T03:10:17.000Z"
  },
  {
    "overall": 3,
    "career": 3,
    "balance": 2,
    "compensation": 3,
    "culture": 1,
    "management": 1,
    "summary": "There’s no culture anymore ",
    "pros": "Smart people to learn from although they are leaving.\n\nI can’t think of anything positive lol ",
    "cons": "There’s no culture anymore . No long term vision. Just make money and leave in 2-3 years. This is not a place for long term.  \n\n\nSwim or sink culture.. you can still be pipped in 7 months if you were unlucky in politics or weak manager. \n\nManagement has significantly slowed career and salary growth. \n\nHorrible WLB 5 days in office . They count your badge swipes and hours spent in office. \n\n",
    "reasonResign": null,
    "createdAt": "2025-05-11T23:41:27.000Z"
  },
  {
    "overall": 3,
    "career": 2,
    "balance": 1,
    "compensation": 2,
    "culture": 2,
    "management": 1,
    "summary": "A toxic company",
    "pros": "A company which just values everything other than the employees ",
    "cons": "Toxicity at it's best. Destroying others careers for growth is a mist",
    "reasonResign": null,
    "createdAt": "2025-05-11T19:04:15.000Z"
  },
  {
    "overall": 1,
    "career": 1,
    "balance": 1,
    "compensation": 1,
    "culture": 1,
    "management": 1,
    "summary": "Horrible place to work",
    "pros": "I only wish if the leadership cared for their employees as much as they care for their customers! ",
    "cons": "The stocks which one receives during the joining time is only the positive point.. once the stocks vest you start questioning your existence in the team/company! ",
    "reasonResign": null,
    "createdAt": "2025-05-11T09:12:45.000Z"
  }
]